from typing import Tuple
import re

ALL_DEPARTMENTS: Tuple = (
    "Биологический факультет", "Географический факультет", "Геологический факультет",
    "Институт дополнительного профессионального образования", "Институт искусств",
    "Институт истории и международных отношений", "Институт физики", "Институт физической культуры и спорта",
    "Институт филологии и журналистики", "Институт химии", "Механико-математический факультет",
    "Социологический факультет", "Факультет иностранных языков и лингводидактики",
    "Факультет компьютерных наук и информационных технологий", "Факультет психологии",
    "Факультет психолого-педагогического и специального образования",
    "Факультет фундаментальной медицины и медицинских технологий", "Философский факультет", "Экономический факультет",
    "Юридический факультет", "Геологический колледж", "Колледж радиоэлектроники им. П.Н. Яблочкова",
    "Психолого-педагогический факультет", "Факультет математики и естественных наук", "Филологический факультет"
)
PROPERTY_TO_FIND: str = "Room"  # "Room" # Acceptable values: "Room", "Teacher", "Name"
PROPERTY_VALUE: str = r"8 корп. ауд. 322".lower()  # "8 корп. ауд. 322"
# DEPARTMENTS_TO_FIND("Институт физики",)  #

BASE_URL = "https://www.sgu.ru"

DEPARTMENTS_PATTERN = re.compile(r"<li><a href='(.+?)'>(.+?)</a></li>")
GROUPS_PATTERN = re.compile(r'<a href="(.+?)">(\d{3,4})</a>')

CLASS_TO_TIME = {
    1: "08:20-09:50",
    2: "10:00-11:35",
    3: "12:05-13:40",
    4: "13:50-15:25",
    5: "15:35-17:10",
    6: "17:20-18:40",
    7: "18:45-20:05",
    8: "20:10-21:30",
}